user_greetings = (
    "👋 Приветствуем тебя в удобном телеграм-боте для студентов и преподавателей!\n\n\n"

    "📅 <b>Основные возможности бота:</b>\n\n"
    
	"📚 Просматривай расписание пар для своей группы.\n"
    
	"🕒 Получай уведомления о предстоящих занятиях.\n\n"
    
    "🔍 <i>Этот бот станет незаменимым помощником не только для студентов, но и для преподавателей. "
    "Удобство и оперативность в одном месте!</i> 💼🎓\n\n"
    
    "Присоединяйся и будь в курсе своего учебного процесса! 🚀"
)

user_registration_warning = (
    "🤖 Привет! Бот нуждается в данных о твоей группе, курсе и идентификаторе телеграмма для корректной работы.\n"
	"Подтверди свое согласие, чтобы бот мог предоставить тебе все возможности.\n"
	"Без этих данных он не сможет работать. 📊✅"
)

user_registration_eula = (
    "📝 <b>Пользовательское соглашение:</b>\n"
	
	"Предоставление данных:\n"
	
	"При использовании функционала телеграмм-бота, "
	"вы соглашаетесь предоставить боту информацию о своем курсе и группе для корректного отображения расписания.\n"
	
	"Введенные вами данные будут сохранены в нашей базе данных и "
	"использоваться исключительно для предоставления вам персонализированного расписания.\n"
	
	"Конфиденциальность:\n"
	
	"Ваши персональные данные будут обрабатываться с соблюдением принципов конфиденциальности и безопасности. "
	"Мы не передаем вашу информацию третьим лицам.\n"
	
	"Безопасность:\n"
	"Мы прилагаем все усилия для обеспечения безопасности ваших данных. Однако, помните, "
	"что безопасность в интернете не гарантирована, и вы также несете ответственность за сохранность своих учетных данных.\n"
	
	"Отказ от ответственности:\n"
	
	"Мы не несем ответственности за любые непредвиденные сбои в работе бота или потерю данных. "
	"Использование бота на ваш собственный риск.\n"
	
	"Согласие с условиями:\n"
	
	"Используя функционал бота, вы подтверждаете свое согласие с вышеуказанными условиями использования."
)

user_admin_description = (
    "Модераторская роль в админ-панели предоставляет уникальные привилегии для редактирования расписания пар студентов."
    "Модераторы имеют эксклюзивный доступ к функционалу изменения расписания, что обеспечивает легкость и удобство в поддержании актуальности "
    "учебных данных. Эта функция призвана обеспечить эффективное взаимодействие с расписанием, позволяя модераторам оперативно вносить необходимые "
    "изменения для обеспечения максимального комфорта и актуальности информации для пользователей бота."
)

user_menu_description = "Чем могу помочь?"

user_error_database_connection = "В данный момент по техническим неполадкам бот недоступен..."

user_error_database_logic = "Логическое исключение, запись в бд повреждена\n\nОбратитесь к администратору бота..."

user_error_auth_unknown = (
    "Вы не зарегистрированы!\n\n"
    "Для регистрации введите комманду /start"
)

user_about = (
    "Вас приветствует не официальный телеграмм-бот колледжа!\n"
	"В данном боте вы сможете:\n"
	"- посмотреть расписание пар для своей группы\n"
	"- получать оповещения о завтрашних парах\n"
	"Данный бот будет полезен не только студентам, но и преподавателям :)"
)


month_map = {
    1: "Январь",
    2: "Февраль",
    3: "Март",
    4: "Апрель",
    5: "Май",
    6: "Июнь",
    7: "Июль",
    8: "Август",
    9: "Сентябрь",
    10: "Октябрь",
    11: "Ноябрь",
    12: "Декабрь"
}

