welcome_message = """Я - твой персональный бот, созданный для того, чтобы помочь тебе следить за расписанием учебных занятий. Теперь ты 
сможешь легко получать информацию о парах в любое время!

Кроме того, я умею считать недели. Это очень удобно, если тебе нужно знать, какая неделя учебная, или сколько недель 
осталось до конца семестра.

Просто введи команду /help, чтобы узнать, как со мной работать. Я готов помочь тебе в любое время! 🤖"""

agreement_message = ("Для функционирования бот собирает и хранит информацию о вашей группе, курсе и идентификатор "
                     "вашего телеграмма студента в зашифрованном виде. Пожалуйста, подтвердите свое согласие, "
                     "так как без этой информации бот не сможет предоставить полноценный функционал.")
