greeting_message = """
Вас приветствует не официальный телеграм-бот колледжа!


В данном боте вы сможете:

- посмотреть расписание пар для своей группы

- получать оповещения о завтрашних парах

Данный бот будет полезен не только студентам, но и преподавателям :)
"""

user_agreement_message = ("Для функционирования бот собирает и хранит информацию о вашей группе, курсе и идентификатор "
                          "вашего телеграмма. Пожалуйста, подтвердите свое согласие, так как без этой "
                          "информации бот не сможет предоставить полноценный функционал.")
